# file location: ~/.brewfile
# brew bundle --file=".brewfile"

# set arguments for all 'brew cask install' commands
cask_args appdir: '/Applications', no_quarantine: true

tap "homebrew/bundle"
tap "homebrew/cask-fonts"

tap "buo/cask-upgrade"  # better cask upgrading (see `cu`)

# CLI tools
brew "7zip"
brew "bash"
brew "bat" # cat alternative with syntax highlighting
brew "FelixKratz/formulae/borders" # focused window borders
brew "chezmoi" # dotfiles management
brew "coreutils" # for gnu date
brew "curl"
brew "diskonaut" # disk usage TUI
brew "duf" # disk usage/free utility, df alternative
brew "dust" # disk usage utility, du alternative
brew "exiftool" # read/write metadata
brew "fd" # find alternative
brew "ffmpeg" # video converter / compressor
brew "fx" # JSON viewer / processor
brew "fzf" # fuzzy finder
brew "gnupg" # "openssl"
brew "grc" # command output colorizer
brew "gum" # easy CLI tools
# brew "httpie" # HTTP client, curl alternative
brew "htop" # system monitor
brew "imagemagick" # image converter / compressor
brew "jless" # JSON viewer
brew 'jq' # grep for JSON
brew 'noahgorstein/tap/jqp' # jq TUI
brew "lsd" # better ls
brew "neovim"
brew "node"
brew "openssl"
brew "renameutils" # bulk renaming / copying
brew "ripgrep" # grep alternative
brew "rga" # ripgrep but for everything (e.g. pdf, jpg, docx, etc)
brew "sesh" # tmux session manager (used with fzf)
brew "koekeishiya/formulae/skhd" # keyboard shortcuts
brew "terminal-notifier"
brew "tlrc" # tldr - docs, manpages alternative
brew "tokei" # project metric counter (e.g. LOC, complexity)
brew "uv" # Python virtual env management
brew "yt-dlp" # YouTube downloader
brew "zoxide" # smart cd replacement

# yazi file manager
brew "yazi" # file manager
brew "ffmpegthumbnailer" # video file preview in yazi
brew "poppler" # pdf preview in yazi

# Git
brew "git"
brew "git-delta" # git diff viewer
brew "git-lfs" # git large file storage
brew "git-spice" # git stack
brew "gh" # GitHub
brew "github-keygen"
# brew "glab" # GitLab

# Tmux
brew "tmux"
# brew "tpm" # tmux plugin manager
# brew "morantron/tmux-fingers/tmux-fingers" # tmux plugin for searching patterns

# development / android (zulu)
tap "mdogan/zulu"
cask "zulu-jdk17"
cask "zulu-jdk21"
cask "zulu-jdk25"
brew "kotlin"
brew "gradle"
brew "scrcpy" # screen mirroring
brew "adb-enhanced" # adb with more features
cask "android-platform-tools" # adb, fastboot
brew "JakeWharton/repo/diffuse" # APK diff
brew "mobile-dev-inc/tap/maestro" # UI automation

# development ## .rb
# brew "asdf"
# brew "ruby-build"
brew "rbenv"
# brew "ruby-install"

# development ## .py
brew "pyenv"
brew "uv"
# brew "python@3.13"

# Mac apps
# cask "1password"
# cask "1password-cli" # required for Raycast/Alfred integration
cask "nikitabobko/tap/aerospace" # tiling window manager
cask "alt-tab" # alt-tab replacement
# cask "appcleaner" # app uninstaller
cask "battery" # stop charge at 80%
# cask "betterdisplay" # display manager
# cask "bettertouchtool" # causes OS freeze on upgrades due to permission issues, better install and upgrade manually
# cask "bruno" # API-client, Postman alternative
# cask "calibre" # ebook manager
# cask "discord"
cask "free-ruler" # screen ruler for measuring pixel distances
# cask "handbrake" # video converter / compressor
# cask "homerow" # keyboard shortcuts for every button on the screen, paid, alt: shortcat
cask "ghostty"
# cask "google-drive"
cask "google-chrome" # browser
cask "grandperspective" # disk space visualizer
cask "firefox" # browser
# cask "iina" # video player
# cask "insomnia" # API client (Postmaan/RapidAPI alternative)
# cask "imageoptim" # image compressor
cask "jetbrains-toolbox" # JetBrains IDEs
cask "jordanbaird-ice" # hide menu bar icons, alternative to hiddenbar (slightly better)
cask "keyboardcleantool" # disable keyboard for cleaning
cask "latest" # update all apps
cask "linearmouse" # mouse acceleration fix
cask "lulu" # connection blocker
# cask "marta" # file manager
# cask "microsoft-edge" # browser
# cask "middleclick" # trackpad middle-click with 3 fingers
cask "mitmproxy" # for debugging network requests
# cask "mullvadvpn"
cask "notunes" # disable iTunes on media button press
# cask "obsidian" # note taking, Markdown
cask "omnidisksweeper" # disk space visualizer and cleaner
# cask "onyx" # system maintenance
cask "pearcleaner" # app uninstaller/cleaner, probably better than appcleaner
# cask "postman" # API client
# cask "proxyman" # for debugging network requests
# cask "qbittorrent" # torrent client
# cask "rapidapi" # API client (Postman alternative)
cask "raycast" # productivity tool, Spotlight replacement
cask "shortcat" # click anything on the screen, alt: homerow
cask "shottr" # screenshot tool
# cask "slack"
# cask "spotify"
cask "sublime-text" # text editor
# cask "table-tool" # CSV editor
cask "the-unarchiver" # unzip
# cask "via" # keyboard configurator (e.g. Keychron)
# cask "visual-studio-code"
# cask "wezterm" # terminal emulator

# fonts
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-mono"

# Karabiner / Goku
# cask "karabiner-elements" # causes OS freeze on upgrades due to permission issues, better install and upgrade manually
# brew "yqrashawn/goku/goku" # Karabiner config manager

##################
# Helpful commands
##################

# https://gist.github.com/ChristopherA/a579274536aab36ea9966f301ff14f3f

# track transitive dependencies
# brew deps --tree --installed asdf

# see ~/.brew.sh for more commands
